In [ ]:
!pip install pandas

In [1]:
import pandas as pd
import numpy as np

In [6]:
a = np.arange(30).reshape(6,5)

In [7]:
a

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24],
       [25, 26, 27, 28, 29]])

In [9]:
df = pd.DataFrame(a)
df

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24
5  25  26  27  28  29

In [10]:
df = pd.DataFrame(a,columns=["A","B","C","D","E"])
df

    A   B   C   D   E
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24
5  25  26  27  28  29

In [17]:
df = pd.DataFrame(a,columns=["A","B","C","D","E"],index=["a","b","c","d","e","f"])       # for rows index
df

    A   B   C   D   E
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19
e  20  21  22  23  24
f  25  26  27  28  29

In [18]:
df.index

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [19]:
df.columns

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [20]:
# reassign 

df.index = [100,101,102,103,104,105]

In [21]:
df

      A   B   C   D   E
100   0   1   2   3   4
101   5   6   7   8   9
102  10  11  12  13  14
103  15  16  17  18  19
104  20  21  22  23  24
105  25  26  27  28  29

In [22]:
d = {"A":[1,2,3,4,5],"B":[6,7,8,9,10]}

# the key will be column name and values will be row

In [23]:
df1 = pd.DataFrame(d)

In [24]:
df1

   A   B
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [40]:
# fetch row or column from dataframe

df1.A

0    1
1    2
2    3
3    4
4    5
Name: A, dtype: int64

In [41]:
df1['B']

0     6
1     7
2     8
3     9
4    10
Name: B, dtype: int64

In [43]:
df1.loc[2]

A    3
B    8
Name: 2, dtype: int64

In [45]:
df1.iloc[2]

A    3
B    8
Name: 2, dtype: int64

In [46]:
# Reassign the values 

df1.iloc[2] = [5,4]
df1.iloc[2]

A    5
B    4
Name: 2, dtype: int64

In [44]:
type(df1.A)

pandas.core.series.Series

In [47]:
df1.iloc[2]['A']

5

In [53]:
# create new value

df1['C'] = [12,23,24,25,25]

In [56]:
df1[['A','B','C']]

   A   B   C
0  1   6  12
1  2   7  23
2  5   4  24
3  4   9  25
4  5  10  25

In [58]:
df1['A']

0    1
1    2
2    5
3    4
4    5
Name: A, dtype: int64

In [60]:
df1

   A   B   C
0  1   6  12
1  2   7  23
2  5   4  24
3  4   9  25
4  5  10  25

In [62]:
# droping rows or columns  

# rows  -> axis = 0
# columns -> axis = 1

df1.drop('A',axis = 1)

    B   C
0   6  12
1   7  23
2   4  24
3   9  25
4  10  25

In [63]:
df1

   A   B   C
0  1   6  12
1  2   7  23
2  5   4  24
3  4   9  25
4  5  10  25

In [64]:
#so actually did not delete so either reassign or inplace=True

df1.drop('A',axis = 1,inplace=True)

In [65]:
df1

    B   C
0   6  12
1   7  23
2   4  24
3   9  25
4  10  25

In [66]:
df1.drop([1,2,3],axis=0,inplace=True)

In [67]:
df1

    B   C
0   6  12
4  10  25

In [70]:
# to reset to default 

df1.reset_index()

   index   B   C
0      0   6  12
1      4  10  25

In [73]:
df1.reset_index(drop=True,inplace=True)

In [74]:
df1

    B   C
0   6  12
1  10  25

In [76]:
# can sort by index or also by value

df1.sort_index(ascending=False)

    B   C
1  10  25
0   6  12

In [78]:
df1.sort_values(by='B')    # sort by column name

    B   C
0   6  12
1  10  25

In [83]:
#like this we can write to files 

df1.to_csv('abc.csv')
df1.to_clipboard()
df1.to_excel('abc.xlsx')

QXcbClipboard::setMimeData: Cannot set X11 selection owner

In [ ]:
pd.read_csv("filepath+name")

# column names will be the first row value